//============================================================
//
//	破壊可能ブロックヘッダー [blockBreak.h]
//	Author：小原立暉
// 
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _BREAK_BLOCK_BREAK_H_
#define _BREAK_BLOCK_BREAK_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "block.h"

//************************************************************
//	クラス定義
//************************************************************
// 破壊可能ブロッククラス
class CBlockBreak : public CBlock
{
public:

	// コンストラクタ
	CBlockBreak();

	// デストラクタ
	~CBlockBreak() override;

	// オーバーライド関数
	HRESULT Init() override;	// 初期化
	void Uninit() override;		// 終了
	void Update(const float fDeltaTime) override;		// 更新
	void Draw(CShader* pShader = nullptr) override;		// 描画

	// メンバ関数
	void Hit() override;		// ヒット処理

private:

};

#endif	// _BREAK_BLOCK_H_
