//============================================================
//
//	コンボエリアマネージャー処理 [comboAreaManager.cpp]
//	Author：小原立暉
//
//============================================================
//************************************************************
//	インクルードファイル
//************************************************************
#include "comboAreaManager.h"

#include "comboArea.h"

//************************************************************
//	定数宣言
//************************************************************
namespace
{
	const int MAX_MULTI = 3;			// コンボエリアの総数
	const VECTOR3 POS[MAX_MULTI] =		// 位置
	{
		VECTOR3(0.0f, 120.0f, 0.0f),
		VECTOR3(0.0f, 360.0f, 0.0f),
		VECTOR3(0.0f, 600.0f, 0.0f),
	};
}

//************************************************************
//	子クラス [CComboAreaManager] のメンバ関数
//************************************************************
//============================================================
//	コンストラクタ
//============================================================
CComboAreaManager::CComboAreaManager() : CObject(CObject::LABEL_COMBOAREA, CObject::DIM_3D, 0)
{

}

//============================================================
//	デストラクタ
//============================================================
CComboAreaManager::~CComboAreaManager()
{

}

//============================================================
//	初期化処理
//============================================================
HRESULT CComboAreaManager::Init()
{
	for (int nCnt = 0; nCnt < MAX_MULTI; nCnt++)
	{
		CComboArea::Create(POS[nCnt], nCnt);
	}

	// 成功を返す
	return S_OK;
}

//============================================================
//	終了処理
//============================================================
void CComboAreaManager::Uninit()
{
	// 破棄
	Release();
}


//============================================================
//	更新処理
//============================================================
void CComboAreaManager::Update(const float fDeltaTime)
{

}

//============================================================
//	描画処理
//============================================================
void CComboAreaManager::Draw(CShader* pShader)
{

}


//============================================================
//	生成処理
//============================================================
CComboAreaManager* CComboAreaManager::Create()
{
	// コンボエリアマネージャーの生成
	CComboAreaManager* pArea = new CComboAreaManager;

	if (pArea == nullptr)
	{ // 生成に失敗した場合

		return nullptr;
	}
	else
	{ // 生成に成功した場合

		// マネージャーの初期化
		if (FAILED(pArea->Init()))
		{ // 初期化に失敗した場合

			// マネージャーの破棄
			SAFE_DELETE(pArea);
			return nullptr;
		}

		// 確保したアドレスを返す
		return pArea;
	}
}
