//============================================================
//
//	ゲーム状態ヘッダー [gameState.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _GAME_STATE_H_
#define _GAME_STATE_H_

//************************************************************
//	前方宣言
//************************************************************
class CGameManager;	// ゲームマネージャークラス

//************************************************************
//	クラス定義
//************************************************************
// ゲーム状態クラス
class CGameState
{
public:
	// コンストラクタ
	CGameState();

	// デストラクタ
	virtual ~CGameState();

	// 純粋仮想関数
	virtual HRESULT Init()	= 0;	// 初期化
	virtual void Uninit()	= 0;	// 終了
	virtual void Update(const float fDeltaTime) = 0;	// 更新

	// メンバ関数
	inline void SetContext(CGameManager* pContext) { m_pContext = pContext; }	// コンテキスト設定

protected:
	// メンバ変数
	CGameManager* m_pContext;	// コンテキスト
};

//************************************************************
//	インクルードファイル
//************************************************************
#include "gameStateStart.h"
#include "gameStateNormal.h"
#include "gameStateEnd.h"

#endif	// _GAME_STATE_H_
