//============================================================
//
//	通常状態ヘッダー [gameStateNormal.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _GAME_STATE_NORMAL_H_
#define _GAME_STATE_NORMAL_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "gameState.h"

//************************************************************
//	クラス定義
//************************************************************
// 通常状態クラス
class CGameStateNormal : public CGameState
{
public:
	// コンストラクタ
	CGameStateNormal();

	// デストラクタ
	~CGameStateNormal() override;

	// オーバーライド関数
	HRESULT Init() override;	// 初期化
	void Uninit() override;		// 終了
	void Update(const float fDeltaTime) override;	// 更新
};

#endif	// _GAME_STATE_NORMAL_H_
