//============================================================
//
//	ディレクショナルライト処理 [lightDir.cpp]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	インクルードファイル
//************************************************************
#include "lightDir.h"

//************************************************************
//	親クラス [CLightDir] のメンバ関数
//************************************************************
//============================================================
//	コンストラクタ
//============================================================
CLightDir::CLightDir()
{

}

//============================================================
//	デストラクタ
//============================================================
CLightDir::~CLightDir()
{

}

//============================================================
//	初期化処理
//============================================================
HRESULT CLightDir::Init()
{
	// ライトの初期化
	if (FAILED(CLight::Init()))
	{ // 初期化に失敗した場合

		assert(false);
		return E_FAIL;
	}

	// ディレクショナルライトを設定
	SetType(D3DLIGHT_DIRECTIONAL);

	return S_OK;
}

//============================================================
//	終了処理
//============================================================
void CLightDir::Uninit()
{
	// ライトの終了
	CLight::Uninit();
}

//============================================================
//	更新処理
//============================================================
void CLightDir::Update(const float fDeltaTime)
{
	// ライトの更新
	CLight::Update(fDeltaTime);
}

//============================================================
//	描画処理
//============================================================
void CLightDir::Draw(CShader* pShader)
{
	// ライトの描画
	CLight::Draw(pShader);
}

//============================================================
//	生成処理
//============================================================
CLightDir* CLightDir::Create()
{
	// ディレクショナルライトの生成
	CLightDir* pLightDir = new CLightDir;
	if (pLightDir == nullptr)
	{ // 生成に失敗した場合

		return nullptr;
	}
	else
	{ // 生成に成功した場合

		// ディレクショナルライトの初期化
		if (FAILED(pLightDir->Init()))
		{ // 初期化に失敗した場合

			// ディレクショナルライトの破棄
			SAFE_DELETE(pLightDir);
			return nullptr;
		}

		// 確保したアドレスを返す
		return pLightDir;
	}
}
