//============================================================
//
//	ランキング状態ヘッダー [rankingState.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _RANKING_STATE_H_
#define _RANKING_STATE_H_

//************************************************************
//	前方宣言
//************************************************************
class CRankingManager;	// ランキングマネージャークラス

//************************************************************
//	クラス定義
//************************************************************
// ランキング状態クラス
class CRankingState
{
public:
	// コンストラクタ
	CRankingState();

	// デストラクタ
	virtual ~CRankingState();

	// 純粋仮想関数
	virtual HRESULT Init()	= 0;	// 初期化
	virtual void Uninit()	= 0;	// 終了
	virtual void Update(const float fDeltaTime) = 0;	// 更新

	// メンバ関数
	inline void SetContext(CRankingManager* pContext) { m_pContext = pContext; }	// コンテキスト設定

protected:
	// メンバ変数
	CRankingManager* m_pContext;	// コンテキスト
};

//************************************************************
//	インクルードファイル
//************************************************************
#include "rankingStateNormal.h"

#endif	// _RANKING_STATE_H_
