//============================================================
//
//	リザルト状態ヘッダー [resultState.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _RESULT_STATE_H_
#define _RESULT_STATE_H_

//************************************************************
//	前方宣言
//************************************************************
class CResultManager;	// リザルトマネージャークラス

//************************************************************
//	クラス定義
//************************************************************
// リザルト状態クラス
class CResultState
{
public:
	// コンストラクタ
	CResultState();

	// デストラクタ
	virtual ~CResultState();

	// 純粋仮想関数
	virtual HRESULT Init()	= 0;	// 初期化
	virtual void Uninit()	= 0;	// 終了
	virtual void Update(const float fDeltaTime) = 0;	// 更新

	// メンバ関数
	inline void SetContext(CResultManager* pContext) { m_pContext = pContext; }	// コンテキスト設定

protected:
	// メンバ変数
	CResultManager* m_pContext;	// コンテキスト
};

//************************************************************
//	インクルードファイル
//************************************************************
#include "resultStateNormal.h"

#endif	// _RESULT_STATE_H_
