//============================================================
//
//	チュートリアル表示状態ヘッダー [titleStateTutorial.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _TITLE_STATE_TUTORIAL_H_
#define _TITLE_STATE_TUTORIAL_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "titleState.h"

//************************************************************
//	前方宣言
//************************************************************
class CObject2D;	// オブジェクト2Dクラス

//************************************************************
//	クラス定義
//************************************************************
// チュートリアル表示状態クラス
class CTitleStateTutorial : public CTitleState
{
public:
	// コンストラクタ
	CTitleStateTutorial();

	// デストラクタ
	~CTitleStateTutorial() override;

	// オーバーライド関数
	HRESULT Init() override;	// 初期化
	void Uninit() override;		// 終了
	void Update(const float fDeltaTime) override;	// 更新

private:
	// メンバ変数
	CObject2D* m_pTutorial;	// チュートリアル情報
};

#endif	// _TITLE_STATE_TUTORIAL_H_
