//============================================================
//
//	ロゴ表示状態ヘッダー [titleStateLogo.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _TITLE_STATE_LOGO_H_
#define _TITLE_STATE_LOGO_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "titleState.h"

//************************************************************
//	前方宣言
//************************************************************
class CObject2D;	// オブジェクト2Dクラス

//************************************************************
//	クラス定義
//************************************************************
// ロゴ表示状態クラス
class CTitleStateLogo : public CTitleState
{
public:
	// コンストラクタ
	CTitleStateLogo();

	// デストラクタ
	~CTitleStateLogo() override;

	// オーバーライド関数
	HRESULT Init() override;	// 初期化
	void Uninit() override;		// 終了
	void Update(const float fDeltaTime) override;	// 更新

private:
	// メンバ関数
	void UpdateDecide();	// 決定更新
	void UpdateTransSelect(const float fDeltaTime);	// タイトル遷移更新

	// メンバ変数
	CObject2D* m_pLogo;	// ロゴ情報
	float m_fCurTime;	// 現在の経過時間
};

#endif	// _TITLE_STATE_LOGO_H_
